const alifSnippets = {
    دالة: "دالة ${اسم}(${معاملات}):",
    اذا: "اذا ${شرط}:",
    اواذا: "اواذا ${شرط}:",
    والا:"والا:",
    لأجل: "لأجل ${متغير} في مدى():",
    بينما: "بينما ${شرط}:",
    
    استمر:"استمر",
    توقف:"توقف",
    انتظر:"انتظر",
    او:"او",

    ارجع:"ارجع ${القيمة}",
    استورد: 'استورد ${وحدة}"',
    احذف: 'احذف ${وحدة}"',
    اصل: "اصل()._تهيئة_(${القيمة})",


    صنف: "صنف ${اسم}:",

    حاول: 'حاول \n    ${محتوى}\n خلل (${خطأ}) \n    اطبع("حدث خطأ: " + ${خطأ})\n',

    اطبع: 'اطبع(${"نص"})',
    ادخل: 'ادخل("${رسالة}")',

};

export { alifSnippets };
