import { احصل, التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";

export function محلل_لاجل(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error('الرموز غير معرفة أو غير صحيحة "محلل_لاجل" ' + الرموز);
    }
    تطابق(الرموز, "كلمة", "لاجل") || تطابق(الرموز, "كلمة", "لأجل");
    // تخطي المسافات والاسطر الفارغة
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    const معرف_متغير = تطابق(الرموز, "معرف");
    if (!معرف_متغير) {
        const error = new Error(`يجب تحديد اسم متغير بعد لاجل`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }
    const المتغير = { نوع: "معرف", اسم: معرف_متغير.القيمة };
    تطابق(الرموز, "كلمة", "في");
    تطابق(الرموز, "كلمة", "مدى");
    التالي(الرموز);
    تطابق(الرموز, "اقواس", "(");
    const الحد = محلل_التعبير(الرموز);
    if (!الحد) {
        const error = new Error(`لا يوجد حد صحيح في لاجل`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }
    تطابق(الرموز, "اقواس", ")");
    if (!تطابق(الرموز, "رمز_حسابي", ":")) {
        const error = new Error(`توقعت ":" بعد تعريف لاجل`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }

    // ما بداخل العجلة
    const القيم = [];
    while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
    if (!تحقق(الرموز, "مسافة")) {
        return { نوع: "لاجل", المتغير, الحد, القيم };
    }
    const التبويب = احصل(الرموز).القيمة.length;
    التالي(الرموز);
    const جملة = محلل_الجملة();
    if (!جملة) {
        const error = new Error(`لا يوجد جملة صحيحة في لاجل`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }
    القيم.push(جملة);
    while (true) {
        while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
        if (!تحقق(الرموز, "مسافة") || احصل(الرموز).القيمة.length < التبويب)
            break;
        التالي(الرموز);
        const جملة = محلل_الجملة();
        if (!جملة) {
            const error = new Error(`لا يوجد جملة صحيحة في لاجل`);
            error.line = `في السطر ` + احصل(الرموز).السطر;
            throw error;
        }
        القيم.push(جملة);
    }

    return { نوع: "لاجل", المتغير, الحد, القيم };
}
