import { رمي_خطأ } from "../AlifErrors.js";
import { محلل_التعبير } from "../Expressions.js";
import { التالي, السابق, تحقق, تطابق } from "../TokenUtils.js";

export function محلل_مترابطة(الرموز, الدالة_الام) {
    السابق(الرموز);
    const قيم = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        const القيمة = محلل_التعبير(الرموز, الدالة_الام);
        if (!القيمة) رمي_خطأ(`خطأ في قيم المترابطة`, الرموز, الدالة_الام);

        قيم.push(القيمة);
        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
        else break;
    }
    if (!تطابق(الرموز, "اقواس", ")"))
        رمي_خطأ(`لم يتم اغلاق القوس ")" بعد المترابطة`, الرموز, الدالة_الام);

    return قيم;
}
