import { التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";
import { إدارة_المسافة_البادئة } from "../Indentation.js";
import { إنشاء_الشفرة } from "../../AlifGenerator.js";

export function محلل_بينما(الرموز) {
    تطابق(الرموز, "كلمة", "بينما");
    // تخطي المسافات والاسطر الفارغة
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    // الشروط
    let الشروط = [];
    while (true) {
        const القيمة = محلل_التعبير(الرموز);
        الشروط.push(القيمة);
        if (تطابق(الرموز, "نقطتان")) break;
    }

    // ما بداخل بينما
    const اوامر = إدارة_المسافة_البادئة(الرموز, "بينما");
    if (!تحقق(الرموز, "مسافة")) {
        return { نوع: "بينما", الشروط, اوامر };
    }

    return { نوع: "بينما", الشروط, اوامر };
}

export function منشئ_بينما(مستوى, عداد, عقدة, داخل_برنامج) {
    const الشروط = عقدة.الشروط
        .map((ج) => إنشاء_الشفرة(ج, مستوى + 1, عداد, داخل_برنامج))
        .join("\n");
    const اوامر = عقدة.اوامر
        .map((ج) => إنشاء_الشفرة(ج, مستوى + 1, عداد, داخل_برنامج))
        .join("\n");
    return `while (${الشروط}) {\n\t${اوامر}\n}`;
}
