import { رمي_خطأ } from "../AlifErrors.js";
import { محلل_التعبير } from "../Expressions.js";
import { التالي, السابق, تحقق, تطابق } from "../TokenUtils.js";
import { إنشاء_الشفرة } from "../../AlifGenerator.js";

export function محلل_المصفوفة(الرموز, الدالة_الام) {
    تطابق(الرموز, "اقواس", "[");
    التالي(الرموز);

    // دعم [7 لاجل _ في مدى(9)]
    if (تحقق(الرموز, "كلمة", "لاجل")) {
        السابق(الرموز);
        const الرقم = تطابق(الرموز).القيمة;
        التالي(الرموز);
        التالي(الرموز);
        تطابق(الرموز, "رمز", "_");
        تطابق(الرموز, "رمز_حسابي", "في");
        تطابق(الرموز, "كلمة", "مدى");
        التالي(الرموز);
        تطابق(الرموز, "اقواس", "(");
        const عدد_التكرار = تطابق(الرموز).القيمة;
        التالي(الرموز);
        تطابق(الرموز, "اقواس", ")");

        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        if (!تطابق(الرموز, "اقواس", "]"))
            رمي_خطأ(`لم يتم اغلاق القوس "]"`, الرموز, الدالة_الام);

        let قيم = [];

        let القيمة = {
            نوع: "قيمة",
            قيمة: الرقم,
        };
        for (let i = 0; i < عدد_التكرار; i++) قيم.push(القيمة);

        return قيم;
    }

    السابق(الرموز);
    const قيم = [];
    while (!تحقق(الرموز, "اقواس", "]")) {
        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        const القيمة = محلل_التعبير(الرموز, الدالة_الام);
        if (!القيمة) رمي_خطأ(`خطأ في قيم القائمة`, الرموز, الدالة_الام);

        قيم.push(القيمة);

        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
        else break;
    }
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
    if (!تطابق(الرموز, "اقواس", "]"))
        رمي_خطأ(`لم يتم اغلاق القوس "]"`, الرموز, الدالة_الام);
    return قيم;
}

export function منشئ_قائمة(عقدة, عداد) {
    const قيم = عقدة.قيم
        .map((القيمة) => `${إنشاء_الشفرة(القيمة, 0, عداد)}`)
        .join(", ");
    return `[${قيم}]`;
}
