import { رمي_خطأ } from "../AlifErrors.js";
import { محلل_التعبير } from "../Expressions.js";
import { التالي, تحقق, تطابق } from "../TokenUtils.js";

export function محلل_الفهرس(الرموز) {
    تطابق(الرموز, "اقواس", "{");
    const خصائص = [];
    while (!تحقق(الرموز, "اقواس", "}")) {
        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        let المفتاح;
        const رمز_المفتاح = تطابق(الرموز, "نص");
        if (!رمز_المفتاح) رمي_خطأ(`لا يوجد مفتاح في الفهرس`, الرموز);
        المفتاح = رمز_المفتاح.القيمة.slice(1, -1);

        if (!تطابق(الرموز, "نقطتان"))
            رمي_خطأ(`لا يوجد ":" بعد المفتاح "${المفتاح}"`, الرموز);

        const القيمة = محلل_التعبير(الرموز);
        if (!القيمة) رمي_خطأ(`لا يوجد قيمة للفهرس "${المفتاح}"`, الرموز);

        خصائص.push({ المفتاح, القيمة });
        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }

    if (!تطابق(الرموز, "اقواس", "}"))
        رمي_خطأ(`لم يتم اغلاق القوس "}" في الفهرس`, الرموز);

    return خصائص;
}
