import { التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";

export function محلل_العمليات(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error(
            'الرموز غير معرفة أو غير صحيحة "محلل_العمليات" ' + الرموز
        );
    }

    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    const يسار = تطابق(الرموز, "رقم") || تطابق(الرموز, "معرف");
    if (!يسار || !("القيمة" in يسار)) {
        التالي(الرموز);
    }

    const عامل = تطابق(الرموز, "رمز_حسابي");
    if (!عامل || !("القيمة" in عامل)) {
        throw new Error("متوقع رمز حسابي بين الأرقام");
    }

    const يمين = تطابق(الرموز, "رقم") || تطابق(الرموز, "معرف");
    if (!يمين || !("القيمة" in يمين)) {
        throw new Error("متوقع رقم في الجهة اليمنى للعملية");
    }

    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    return {
        نوع: "عملية",
        القيم: {
            يسار: {
                نوع: "عدد",
                قيمة: !isNaN(Number(يسار.القيمة))
                    ? Number(يسار.القيمة)
                    : يسار.القيمة,
            },
            عامل: { نوع: "رمز_حسابي", قيمة: عامل.القيمة },
            يمين: {
                نوع: "عدد",
                قيمة: !isNaN(Number(يمين.القيمة))
                    ? Number(يمين.القيمة)
                    : يمين.القيمة,
            },
        },
    };
}

export function منشئ_عمليات(عقدة) {
    const يسار = عقدة.القيم.يسار.قيمة;
    const عامل = عقدة.القيم.عامل.قيمة;
    const يمين = عقدة.القيم.يمين.قيمة;

    let مع_متغير =
        typeof يسار == "number" && typeof يمين == "number" ? false : true;

    let الناتج = null;
    switch (عامل) {
        case "+":
            مع_متغير ? (الناتج = `${يسار} + ${يمين}`) : (الناتج = يسار + يمين);
            break;
        case "-":
            مع_متغير ? (الناتج = `${يسار} - ${يمين}`) : (الناتج = يسار - يمين);
            break;
        case "*":
            مع_متغير ? (الناتج = `${يسار} * ${يمين}`) : (الناتج = يسار * يمين);
            break;
        case "\\":
            مع_متغير ? (الناتج = `${يسار} / ${يمين}`) : (الناتج = يسار / يمين); // قسمة
            break;
        case "\\\\": // باقي القسمة
            مع_متغير ? (الناتج = `${يسار} % ${يمين}`) : (الناتج = يسار % يمين);
            break;
        case "\\*": // ناتج القسمة
            مع_متغير
                ? (الناتج = `Math.floor(${يسار} / ${يمين})`)
                : (الناتج = Math.floor(يسار / يمين));
            break;
        case "^":
            مع_متغير
                ? (الناتج = `Math.pow(${يسار}, ${يمين})`)
                : (الناتج = Math.pow(يسار, يمين)); // قوة
            break;
        case "\\^":
            مع_متغير
                ? (الناتج = `Math.sqrt(${يمين})`)
                : (الناتج = Math.sqrt(يمين)); // جذر
            break;
        default:
            throw new Error("رمز حسابي غير معروف");
    }
    return مع_متغير ? الناتج : الناتج.toString();
}
