import { احصل, التالي, تحقق, تطابق, المؤشر } from "../TokenUtils.js";
import { محلل_الجملة } from "../../AlifParser.js";
import { إنشاء_الشفرة } from "../../AlifGenerator.js";

export function محلل_دالة(الرموز) {
    تطابق(الرموز, "كلمة", "دالة");

    const الاسم = تطابق(الرموز, "معرف");
    if (!الاسم) {
        const error = new Error(`لا يوجد اسم للدالة`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }

    تطابق(الرموز, "اقواس", "(");
    const المعاملات = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        const معرف = تطابق(الرموز, "معرف");
        if (معرف) المعاملات.push(معرف.القيمة);
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }
    تطابق(الرموز, "اقواس", ")");

    if (!تطابق(الرموز, "نقطتان")) {
        console.error(`توقعت ":" بعد تعريف الدالة`);
    }

    const القيم = [];
    while (
        المؤشر < الرموز.length &&
        !تحقق(الرموز, "كلمة", "دالة") &&
        !تحقق(الرموز, "كلمة", "نهاية")
    ) {
        if (تحقق(الرموز, "سطر_جديد")) {
            التالي(الرموز);
            continue;
        }
        القيم.push(محلل_الجملة(الرموز));
    }

    return {
        نوع: "دالة",
        اسم: الاسم.القيمة,
        معاملات: المعاملات,
        القيم: القيم,
    };
}

export function منشئ_دالة(مستوى, عداد, عقدة, داخل_برنامج) {
    const اسم = عقدة.اسم;
    const معاملات = (عقدة.معاملات || []).join(", ");
    const القيم = عقدة.القيم
        .map((ج) => إنشاء_الشفرة(ج, مستوى + 1, عداد, داخل_برنامج))
        .join("\n");
    return `function ${اسم}(${معاملات}) {\n${القيم}\n}`;
}
