import { احصل, التالي, تحقق, تطابق, المؤشر } from "../TokenUtils.js";

export function محلل_دالة(الرموز) {
    تطابق(الرموز, "كلمة", "دالة");

    const الاسم = تطابق(الرموز, "معرف");
    if (!الاسم) {
        const error = new Error(`لا يوجد اسم للدالة`);
        error.line = `في السطر ` + احصل(الرموز).السطر;
        throw error;
    }

    تطابق(الرموز, "اقواس", "(");
    const المعاملات = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        const معرف = تطابق(الرموز, "معرف");
        if (معرف) المعاملات.push(معرف.القيمة);
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }
    تطابق(الرموز, "اقواس", ")");

    if (!تطابق(الرموز, "رمز_حسابي", ":")) {
        console.error(`توقعت ":" بعد تعريف الدالة`);
    }

    const القيم = [];
    while (
        المؤشر < رموز.length &&
        !تحقق(الرموز, "كلمة", "دالة") &&
        !تحقق(الرموز, "كلمة", "نهاية")
    ) {
        if (تحقق(الرموز, "سطر_جديد")) {
            التالي(الرموز);
            continue;
        }
        القيم.push(محلل_الجملة());
    }

    return {
        نوع: "دالة",
        اسم: الاسم.القيمة,
        معاملات: المعاملات,
        القيم: القيم,
    };
}
