import {التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";

export function محلل_العمليات(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error(
            'الرموز غير معرفة أو غير صحيحة "محلل_العمليات" ' + الرموز
        );
    }

    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    const يسار = تطابق(الرموز, "رقم");
    if (!يسار || !("القيمة" in يسار)) {
        throw new Error("متوقع رقم في الجهة اليسرى للعملية");
    }

    const عامل = تطابق(الرموز, "رمز_حسابي");
    if (!عامل || !("القيمة" in عامل)) {
        throw new Error("متوقع رمز حسابي بين الأرقام");
    }

    const يمين = تطابق(الرموز, "رقم");
    if (!يمين || !("القيمة" in يمين)) {
        throw new Error("متوقع رقم في الجهة اليمنى للعملية");
    }

    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    return {
        نوع: "عملية",
        القيم: {
            يسار: { نوع: "عدد", قيمة: Number(يسار.القيمة) },
            عامل: { نوع: "رمز_حسابي", قيمة: عامل.القيمة },
            يمين: { نوع: "عدد", قيمة: Number(يمين.القيمة) },
        },
    };
}

export function منشئ_عمليات(عقدة) {
    const يسار = عقدة.القيم.يسار.قيمة;
    const عامل = عقدة.القيم.عامل.قيمة;
    const يمين = عقدة.القيم.يمين.قيمة;

    let الناتج = null;
    switch (عامل) {
        case "+":
            الناتج = يسار + يمين;
            break;
        case "-":
            الناتج = يسار - يمين;
            break;
        case "*":
            الناتج = يسار * يمين;
            break;
        case "\\":
            الناتج = يسار / يمين; // قسمة
            break;
        case "\\\\": // باقي القسمة
            الناتج = يسار % يمين;
            break;
        case "\\*": // ناتج القسمة
            الناتج = Math.floor(يسار / يمين);
            break;
        case "^":
            الناتج = Math.pow(يسار, يمين); // قوة
            break;
        case "\\^":
            الناتج = Math.sqrt(يسار); // جذر
            break;
        default:
            throw new Error("رمز حسابي غير معروف");
    }

    return الناتج.toString();
}
