import { احصل, التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";

export function محلل_بينما(الرموز) {
    تطابق(الرموز, "كلمة", "بينما");
    // تخطي المسافات والاسطر الفارغة
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    // الشروط
    let الشروط = [];
    while (true) {
        const القيمة = محلل_التعبير(الرموز);
        الشروط.push(القيمة);
        if (تطابق(الرموز, "رمز_حسابي", ":")) break;
    }

    // ما بداخل بينما
    const القيم = [];
    while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
    if (!تحقق(الرموز, "مسافة")) {
        return { نوع: "بينما", الشروط, القيم };
    }
    const التبويب = احصل(الرموز).القيمة.length;
    التالي(الرموز);
    القيم.push(محلل_الجملة());
    while (true) {
        while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
        if (!تحقق(الرموز, "مسافة") || احصل(الرموز).القيمة.length < التبويب)
            break;
        التالي(الرموز);
        القيم.push(محلل_الجملة());
    }

    return { نوع: "بينما", الشروط, القيم };
}
