import { محلل_التعبير } from "../Expressions.js";
import { التالي, تحقق, تطابق } from "../TokenUtils.js";

export function محلل_استورد(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error(
            'الرموز غير معرفة أو غير صحيحة "محلل_استورد" ' + الرموز
        );
    }
    تطابق(الرموز, "كلمة", "استورد");
    if (تحقق(الرموز, "كلمة", "الوقت") || تحقق(الرموز, "كلمة", "الرياضيات")) {
        التالي(الرموز);
        return { نوع: "استورد", قيمة: null };
    }
    const قيمة = محلل_التعبير(الرموز);
    return { نوع: "استورد", قيمة };
}
