import { احصل, التالي, تحقق, تطابق } from "../TokenUtils.js";
import { محلل_التعبير } from "../Expressions.js";

export function محلل_الواجه_داخلي(الرموز, الكلمة) {
    تطابق(الرموز, "كلمة", الكلمة);

    // تخطي المسافات والأسطر الجديدة
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    تطابق(الرموز, "اقواس", "(");
    const قيم = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        const قيمة = محلل_التعبير(الرموز);
        قيم.push({ القيمة: قيمة });

        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
        else break;
    }
    تطابق(الرموز, "اقواس", ")");
    تطابق(الرموز, "رمز_حسابي", ":");

    const اوامر = [];
    while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
    if (!تحقق(الرموز, "مسافة")) {
        return { نوع: الكلمة, قيم, اوامر };
    }
    const التبويب = احصل(الرموز).القيمة.length;
    التالي(الرموز);
    اوامر.push(محلل_الجملة());
    while (true) {
        while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);
        if (!تحقق(الرموز, "مسافة") || احصل(الرموز).القيمة.length < التبويب)
            break;
        التالي(الرموز);
        اوامر.push(محلل_الجملة());
    }

    return { نوع: الكلمة, قيم, اوامر };
}

export function محلل_الواجه(الرموز, الكلمة) {
    تطابق(الرموز, "كلمة", الكلمة);
    تطابق(الرموز, "اقواس", "(");
    const قيم = [];
    // تخطي المسافات والاسطر الفارغة
    while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    while (true) {
        // اضف القيمة
        const قيمة = محلل_التعبير(الرموز);
        قيم.push({ القيمة: قيمة });

        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
        else break;
    }

    تطابق(الرموز, "اقواس", ")");
    return { نوع: الكلمة, قيم };
}
