import { احصل, التالي, تحقق, تطابق } from "../TokenUtils.js";
import { إدارة_المسافة_البادئة } from "../Indentation.js";
import { إنشاء_الشفرة } from "../../AlifGenerator.js";
import { محلل_الجملة } from "../../AlifParser.js";
import { رمي_خطأ } from "../AlifErrors.js";
import { محلل_التعبير } from "../Expressions.js";
import { حفظ_دالة, جلب_دالة } from "../AlifMemory.js";

export function محلل_دالة(الرموز, الدالة_الام) {
    تطابق(الرموز, "كلمة", "دالة");

    let اسم;

    if (تحقق(الرموز, "كلمة", "_تهيئة_")) {
        اسم = تطابق(الرموز, "كلمة", "_تهيئة_");
    } else {
        اسم = تطابق(الرموز, "معرف");
    }
    if (!اسم) رمي_خطأ("لا يوجد اسم للدالة", الرموز, الدالة_الام);

    حفظ_دالة(اسم.القيمة, {
        معاملات: [],
    });

    let دالة = جلب_دالة(اسم.القيمة);

    تطابق(الرموز, "اقواس", "(");
    const معاملات = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        if (تحقق(الرموز, "معرف")) {
            const اسم_المعرف = احصل(الرموز).القيمة;
            التالي(الرموز);

            if (تحقق(الرموز, "علامة_إسناد")) {
                التالي(الرموز);
                const قيمة = محلل_الجملة(الرموز, الدالة_الام);
                if (قيمة) {
                    معاملات.push({ اسم: اسم_المعرف, قيمة: قيمة.رمز.القيمة });
                }
            } else {
                معاملات.push({ قيمة: اسم_المعرف });
            }
        } else {
            const قيمة = محلل_الجملة(الرموز, الدالة_الام);
            if (قيمة) معاملات.push({ قيمة: قيمة.القيمة });
        }
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }
    if (!تطابق(الرموز, "اقواس", ")"))
        رمي_خطأ(
            `لم يتم اغلاق القوس ")" بعد معاملات الدالة`,
            الرموز,
            الدالة_الام
        );

    دالة = جلب_دالة(اسم.القيمة);
    دالة.معاملات = معاملات.map((م) => ({
        اسم: م.اسم ? م.اسم : م.قيمة,
        قيمة: م.قيمة ?? null,
    }));

    if (!تطابق(الرموز, "نقطتان"))
        رمي_خطأ(`توقعت ":" بعد تعريف الدالة`, الرموز, الدالة_الام);

    const اوامر = إدارة_المسافة_البادئة(الرموز, الدالة_الام, "دالة");
    if (!تحقق(الرموز, "مسافة")) {
        return { نوع: "دالة", اسم: اسم.القيمة, معاملات, اوامر };
    }
    return {
        نوع: "دالة",
        اسم: اسم.القيمة,
        معاملات,
        اوامر,
    };
}

export function منشئ_دالة(مستوى, عداد, عقدة, داخل_برنامج) {
    const اسم = عقدة.اسم;
    const معاملات = Array.isArray(عقدة.معاملات)
        ? عقدة.معاملات
              .map((م) => {
                  if (م.اسم) {
                      return `${م.اسم} = ${م.قيمة}`;
                  }
                  return م.قيمة;
              })
              .join(", ")
        : "خطأ";
    const اوامر = عقدة.اوامر
        .map((ج) => إنشاء_الشفرة(ج, مستوى + 1, عداد, داخل_برنامج))
        .join("\n");

    // الدوال داخل صنف
    if (اسم === "_تهيئة_") return `constructor (${معاملات}) {\n${اوامر}\n}`;

    return `function ${اسم}(${معاملات}) {\n${اوامر}\n}`;
}

export function محلل_إستدعاء_دالة(الرموز, الدالة_الام) {
    const اسم = تطابق(الرموز, "معرف").القيمة;
    if (!جلب_دالة(اسم))
        رمي_خطأ(`الدالة "${اسم}" غير موجودة`, الرموز, "إستدعاء_دالة");

    تطابق(الرموز, "اقواس", "(");

    let معاملات = [];
    while (!تحقق(الرموز, "اقواس", ")")) {
        // اضف القيمة
        const قيمة = محلل_التعبير(الرموز, الدالة_الام);
        if (!قيمة) break;

        if (تحقق(الرموز, "علامة_إسناد")) {
            التالي(الرموز);
            const قيمة_الإسناد = محلل_التعبير(الرموز, الدالة_الام);

            const دالة_حالية = جلب_دالة(اسم);
            for (let i = 0; i < دالة_حالية.معاملات.length; i++) {
                const اسم_المعامل = دالة_حالية.معاملات[i].اسم;

                if (اسم_المعامل === قيمة.اسم) {
                    معاملات[i] = قيمة_الإسناد;
                    دالة_حالية.معاملات[i].قيمة = قيمة_الإسناد.قيمة;
                    break;
                }
            }

            const دالة = جلب_دالة(اسم);
            const اسماء_المعاملات = دالة.معاملات.map((م) => م.اسم);
            const قيمة_المعاملات = دالة.معاملات.map((م) => م.قيمة);

            // for (let i = 0; i < اسماء_المعاملات.length; i++) {
            //     const اسم_معامل = اسماء_المعاملات[i];
            //     if (اسماء_المعاملات[i] == قيمة_المعاملات[i]) {
            //         رمي_خطأ(`المعامل "${اسم_معامل}" لم يُمرر له قيمة`, الرموز);
            //     }
            // }

            if (!اسماء_المعاملات.includes(قيمة.اسم))
                رمي_خطأ(
                    `المعامل "${قيمة.اسم}" غير موجود`,
                    الرموز,
                    "إستدعاء_دالة"
                );
        } else {
            معاملات.push(قيمة);
        }

        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة")) التالي(الرموز);

        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }
    if (!تطابق(الرموز, "اقواس", ")"))
        رمي_خطأ(
            `لم يتم اغلاق القوس ")" بعد معاملات إستدعاء الدالة`,
            الرموز,
            "إستدعاء_دالة"
        );
    return {
        نوع: "استدعاء_دالة",
        اسم,
        معاملات,
    };
}

export function منشئ_استدعاء_دالة(مستوى, عداد, عقدة) {
    const اسم = عقدة.اسم;
    const معاملات = Array.from(عقدة.معاملات, (م) =>
        م ? إنشاء_الشفرة(م, مستوى, عداد) : "undefined"
    );
    const قيمة = معاملات.join(", ");

    return `${اسم}(${قيمة})`;
}
