import { رمي_خطأ } from "../AlifErrors.js";
import { محلل_التعبير } from "../Expressions.js";
import { التالي, تحقق, تطابق } from "../TokenUtils.js";
import { إنشاء_الشفرة } from "../../AlifGenerator.js";

export function محلل_الفهرس(الرموز, الدالة_الام) {
    تطابق(الرموز, "اقواس", "{");
    const خصائص = [];
    while (!تحقق(الرموز, "اقواس", "}")) {
        // تخطي المسافات والاسطر الفارغة
        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        let المفتاح;
        const رمز_المفتاح = تطابق(الرموز, "نص");
        if (!رمز_المفتاح)
            رمي_خطأ(`لا يوجد مفتاح في الفهرس`, الرموز, الدالة_الام);
        المفتاح = رمز_المفتاح.القيمة.slice(1, -1);

        if (!تطابق(الرموز, "نقطتان"))
            رمي_خطأ(
                `لا يوجد ":" بعد المفتاح "${المفتاح}"`,
                الرموز,
                الدالة_الام
            );

        const القيمة = محلل_التعبير(الرموز, الدالة_الام);
        if (!القيمة)
            رمي_خطأ(`لا يوجد قيمة للفهرس "${المفتاح}"`, الرموز, الدالة_الام);

        خصائص.push({ المفتاح, القيمة });

        while (تحقق(الرموز, "مسافة") || تحقق(الرموز, "سطر_جديد"))
            التالي(الرموز);

        // اذا لا يوجد فاصلة توقف
        if (تحقق(الرموز, "فاصلة")) التالي(الرموز);
    }

    if (!تطابق(الرموز, "اقواس", "}"))
        رمي_خطأ(`لم يتم اغلاق القوس "}" في الفهرس`, الرموز, الدالة_الام);

    return خصائص;
}

export function منشئ_الفهرس(عقدة, عداد) {
    const القيم = عقدة.خصائص
        .map(
            ({ المفتاح, القيمة }) =>
                `"${المفتاح}": ${إنشاء_الشفرة(القيمة, 0, عداد)}`
        )
        .join(", ");
    return `{${القيم}}`;
}
