export class AlifMemory {
    constructor() {
        this.ذاكرة_المتغيرات = new Map();
    }

    تهيئة_ذاكرة_المتغيرات(الدالة_الام) {
        if (!this.ذاكرة_المتغيرات.has(الدالة_الام)) {
            this.ذاكرة_المتغيرات.set(الدالة_الام, new Map());
        }
        return this.ذاكرة_المتغيرات.get(الدالة_الام);
    }

    تحديد_نوع_المتغير(القيمة) {
        let نوع_القيمة;
        const مصفوفة =
            القيمة.trim().startsWith("[") && القيمة.trim().endsWith("]");
        const فهرس =
            القيمة.trim().startsWith("{") && القيمة.trim().endsWith("}");
        const رقم = !isNaN(القيمة);
        const نص =
            (القيمة.trim().startsWith('"') && القيمة.trim().endsWith('"')) ||
            (القيمة.trim().startsWith("'") && القيمة.trim().endsWith("'"));

        if (مصفوفة) نوع_القيمة = "مصفوفة";
        else if (فهرس) نوع_القيمة = "فهرس";
        else if (رقم) نوع_القيمة = "رقم";
        else if (نص) نوع_القيمة = "نص";
        else نوع_القيمة = "امر";
        return نوع_القيمة;
    }

    متغير_موجود(الدالة_الام, اسم_المتغير) {
        const ذاكرة = this.ذاكرة_المتغيرات.get(الدالة_الام);
        return ذاكرة ? ذاكرة.has(اسم_المتغير) : false;
    }

    إضافة_متغير(الدالة_الام, اسم_المتغير, القيمة, نوع_القيمة) {
        const الذاكرة = this.تهيئة_ذاكرة_المتغيرات(الدالة_الام);
        الذاكرة.set(اسم_المتغير, { القيمة, نوع_القيمة });
    }

    تحديث_قيمة_المتغير(الدالة_الام, اسم_المتغير, القيمة) {
        const نوع_القيمة = القيمة ? this.تحديد_نوع_المتغير(القيمة) : "";
        const الذاكرة = this.تهيئة_ذاكرة_المتغيرات(الدالة_الام);
        الذاكرة.set(اسم_المتغير, { القيمة, نوع_القيمة });
    }

    نوع_المتغير(اسم_المتغير) {
        for (const متغيرات of this.ذاكرة_المتغيرات.values()) {
            if (متغيرات.has(اسم_المتغير)) {
                return متغيرات.get(اسم_المتغير).نوع_القيمة;
            }
        }
        return null;
    }

    مسح_ذاكرة_المتغيرات(الدالة_الام) {
        this.ذاكرة_المتغيرات.delete(الدالة_الام);
    }

    مسح_الكل() {
        this.ذاكرة_المتغيرات.clear();
    }
}

export const ذاكرة = new AlifMemory();

export function تحديث_ذاكرة_المتغير(الدالة_الام, اسم_المتغير, القيمة) {
    ذاكرة.تحديث_قيمة_المتغير(الدالة_الام, اسم_المتغير, القيمة);
    console.log(ذاكرة.ذاكرة_المتغيرات);
}
