import { محلل_التعبير } from "./Expressions.js";
import { محلل_عام_للاقواس_يسبقها_نقطة } from "./Statements/AlifGeneral.js";
import { التالي, السابق, تحقق, تطابق } from "./TokenUtils.js";

export function محلل_النقطة(الرموز, الدالة_الام) {
    let القيمة = "";
    if (تحقق(الرموز, "معرف")) القيمة = تطابق(الرموز, "معرف").القيمة;
    else التالي(الرموز);

    التالي(الرموز);
    const الكلمة = محلل_التعبير(الرموز, الدالة_الام);
    if (
        الكلمة.المتغير == "مفاتيح" ||
        الكلمة.المتغير == "قيم" ||
        الكلمة.المتغير == "اضف" ||
        الكلمة.المتغير == "امسح" ||
        الكلمة.المتغير == "ادرج" ||
        الكلمة.المتغير == "رتب"
    ) {
        if (
            الكلمة.المتغير != "مفاتيح" &&
            الكلمة.المتغير != "قيم" &&
            الكلمة.المتغير != "رتب"
        )
            السابق(الرموز);
        السابق(الرموز);
        السابق(الرموز);
        السابق(الرموز);
        return محلل_عام_للاقواس_يسبقها_نقطة(
            الرموز,
            الدالة_الام,
            القيمة,
            الكلمة.المتغير
        );
    }
    return { نوع: "معرف_صنف", أسماء_صنف: [القيمة, الكلمة] };
}
