import { احصل, التالي, تحقق, تطابق } from "./TokenUtils.js";
import { محلل_الجملة } from "../AlifParser.js";
import { رمي_خطأ } from "./AlifErrors.js";

export function إدارة_المسافة_البادئة(الرموز, الدالة_الام, الكلمة) {
    const اوامر = [];
    const السطر = احصل(الرموز).السطر;

    while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    // تحقق من وجود مسافة بادئة
    if (!تحقق(الرموز, "مسافة"))
        رمي_خطأ(`يجب وجود مسافة بادئة في "${الكلمة}"`, الرموز, الدالة_الام);

    // احصل على طول المسافة البادئة
    const التبويب = تطابق(الرموز, "مسافة").القيمة.length;

    // دالة مساعدة لفحص وجود جملة صحيحة وإلا رمي خطأ
    function تحقق_جملة_صحيحة() {
        if (اوامر.length === 0)
            رمي_خطأ(`لا يوجد جملة صحيحة في ${الكلمة}`, الرموز, الدالة_الام);
    }

    اوامر.push(
        محلل_الجملة(
            الرموز,
            `${الكلمة}${الكلمة == "برنامج" ? "" : السطر} ,${الدالة_الام}`
        )
    );
    تحقق_جملة_صحيحة();

    while (true) {
        // تجاهل الاسطر الجديدة
        while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

        if (!تحقق(الرموز, "مسافة") || احصل(الرموز).القيمة.length < التبويب)
            break;

        التالي(الرموز);
        اوامر.push(
            محلل_الجملة(
                الرموز,
                `${الكلمة}${الكلمة == "برنامج" ? "" : السطر} ,${الدالة_الام}`
            )
        );
        if (اوامر.length == 0)
            رمي_خطأ(`لا يوجد اوامر في ${الكلمة}`, الرموز, الدالة_الام);
        تحقق_جملة_صحيحة();
    }

    return اوامر;
}
