import { احصل, التالي, تحقق } from "./TokenUtils.js";
import { محلل_الجملة } from "../AlifParser.js";

export function إدارة_المسافة_البادئة(الرموز, الكلمة) {
    const اوامر = [];
    while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

    const التبويب = احصل(الرموز).القيمة.length;
    التالي(الرموز);

    // دالة مساعدة لفحص وجود جملة صحيحة وإلا نرمي خطأ
    function تحقق_جملة_صحيحة() {
        if (اوامر.length === 0) {
            const error = new Error(`لا يوجد جملة صحيحة في ${الكلمة}`);
            error.line = `في السطر ${احصل(الرموز).السطر}`;
            throw error;
        }
    }

    اوامر.push(محلل_الجملة(الرموز));
    تحقق_جملة_صحيحة();

    while (true) {
        while (تحقق(الرموز, "سطر_جديد")) التالي(الرموز);

        if (!تحقق(الرموز, "مسافة") || احصل(الرموز).القيمة.length < التبويب)
            break;

        التالي(الرموز);
        اوامر.push(محلل_الجملة(الرموز));
        تحقق_جملة_صحيحة();
    }

    return اوامر;
}
