import { احصل, التالي, تحقق, المؤشر } from "./Core/TokenUtils.js";

import {
    محلل_عام_للاقواس_يسبقها_نقطة,
    محلل_عام_للاقواس,
    محلل_عام_للكلمات,
} from "./Core/Statements/AlifGeneral.js";
import { محلل_متغير } from "./Core/Statements/AlifVariable.js";
import { محلل_لاجل } from "./Core/Statements/AlifFor.js";
import { محلل_بينما } from "./Core/Statements/AlifWhile.js";
import { محلل_دالة } from "./Core/Statements/AlifFunction.js";
import { محلل_اذا } from "./Core/Statements/AlifIF.js";
import { محلل_الواجهة } from "./Core/Statements/AlifUI.js";
import { محلل_العمليات } from "./Core/Statements/AlifOperations.js";

export const المحللات = {
    اطبع: محلل_عام_للاقواس,
    ادخل: محلل_عام_للاقواس,
    طول: محلل_عام_للاقواس,
    اقصى: محلل_عام_للاقواس,
    ادنى: محلل_عام_للاقواس,
    اشعار: محلل_عام_للاقواس,
    صحيح: محلل_عام_للاقواس,
    عشري: محلل_عام_للاقواس,
    مصفوفة: محلل_عام_للاقواس,
    // جلب: محلل_عام_للاقواس,
    اضف: محلل_عام_للاقواس_يسبقها_نقطة,
    ادرج: محلل_عام_للاقواس_يسبقها_نقطة,
    امسح: محلل_عام_للاقواس_يسبقها_نقطة,
    مفاتيح: محلل_عام_للاقواس_يسبقها_نقطة,
    استمر: محلل_عام_للكلمات,
    توقف: محلل_عام_للكلمات,
    عام: محلل_عام_للكلمات,
    عدم: محلل_عام_للكلمات,
    استورد: محلل_عام_للكلمات,
    ارجع: محلل_عام_للكلمات,
    احذف: محلل_عام_للكلمات,
    صح: محلل_عام_للكلمات,
    خطا: محلل_عام_للكلمات,
    خطأ: محلل_عام_للكلمات,
    عدم: محلل_عام_للكلمات,
    لاجل: محلل_لاجل,
    لأجل: محلل_لاجل,
    بينما: محلل_بينما,
    متغير: محلل_متغير,
    دالة: محلل_دالة,
    اذا: محلل_اذا,
    إذا: محلل_اذا,
    عملية: محلل_العمليات,
    // ===== الواجهة
    نص: محلل_الواجهة,
    رابط: محلل_الواجهة,
    عمودي: محلل_الواجهة,
    رأسي: محلل_الواجهة,
    توسيط: محلل_الواجهة,
    بطاقة: محلل_الواجهة,
    صفحة: محلل_الواجهة,
};

export function محلل_الجملة(الرموز) {
    const الامر = احصل(الرموز)?.القيمة;
    if (الامر && المحللات[الامر]) return المحللات[الامر](الرموز, الامر);

    const متغير = محلل_متغير(الرموز);
    if (متغير) return متغير;

    const رمز = احصل(الرموز);
    التالي(الرموز);
    return { نوع: "غير_معروف", رمز };
}

export function محلل_الرموز(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error(
            "الرموز غير معرفة أو غير صحيحة 'محلل_الرموز' " + الرموز
        );
    }

    function ابدأ() {
        const جمل = [];
        while (المؤشر < الرموز.length) {
            if (تحقق(الرموز, "سطر_جديد")) {
                التالي(الرموز);
                continue;
            }
            جمل.push(محلل_الجملة(الرموز));
        }
        return { نوع: "برنامج", جمل };
    }
    return ابدأ();
}
