import { منشئ_عام_للاقواس } from "./Core/Statements/AlifGeneral.js";
import { منشئ_متغير, منشئ_متغير_مجمع } from "./Core/Statements/AlifVariable.js";
import { منشئ_لاجل } from "./Core/Statements/AlifFor.js";
import { منشئ_بينما } from "./Core/Statements/AlifWhile.js";
import {
    منشئ_استدعاء_دالة,
    منشئ_دالة,
} from "./Core/Statements/AlifFunction.js";
import { منشئ_اذا } from "./Core/Statements/AlifIF.js";
import { منشئ_عمليات } from "./Core/Statements/AlifOperations.js";
import { منشئ_عام_الواجهة } from "./Core/Statements/AlifUI.js";
import { منشئ_الوقت } from "./Core/Libraries/AlifTime.js";
import { منشئ_الرياضيات } from "./Core/Libraries/AlifMath.js";
import { منشئ_حاول } from "./Core/Statements/AlifTry.js";

export function إنشاء_الشفرة(
    ast,
    مستوى = 0,
    عداد = { قيمة: 0 },
    داخل_برنامج = false
) {
    const مولدات = {
        برنامج: (عقدة) => {
            const كود = عقدة.جمل
                .map((ج) => إنشاء_الشفرة(ج, مستوى, عداد, true))
                .join("\n");
            return `
            const __fragment = document.createDocumentFragment();
            const التصميم = document.createElement("style");
            التصميم.textContent = \`* {padding: 0; margin: 0; box-sizing: border-box;}\`;
            document.head.appendChild(التصميم);
            function مدى(البداية, النهاية, خطوة = 1) {
                let الناتج = [];
                if (خطوة > 0) {
                    for (let i = البداية; i < النهاية; i += خطوة) {
                        الناتج.push(i);
                    }
                } else {
                    for (let i = البداية; i > النهاية; i += خطوة) {
                        الناتج.push(i);
                    }
                }
                return الناتج;
            }
            function المضروب(رقم) {
                if (رقم < 0) return undefined; // المضروب مش معرف للأعداد السالبة
                if (رقم === 0 || رقم === 1) return 1;
                let الناتج = 1;
                for (let i = 2; i <= رقم; i++) {
                    الناتج *= i;
                }
                return الناتج;
            }
            function مسافة(نقطة1, نقطة2) {
                return Math.sqrt((نقطة2[0] - نقطة1[0]) ** 2 + (نقطة2[1] - نقطة1[1]) ** 2);
            }
            async function AlifApp() {
            ${كود}
            }
            AlifApp();
            document.body.appendChild(__fragment);`;
        },

        متغير: (عقدة) => منشئ_متغير(مستوى, عداد, عقدة),
        متغير_مجمع: (عقدة) => منشئ_متغير_مجمع(مستوى, عداد, عقدة),

        اطبع: منشئ_عام_للاقواس(مستوى, عداد, "console.log"),
        ادخل: منشئ_عام_للاقواس(مستوى, عداد, "prompt"),
        طول: منشئ_عام_للاقواس(مستوى, عداد, "Object.keys", { اضافة: ".length" }),
        اقصى: منشئ_عام_للاقواس(مستوى, عداد, "Math.max", { عداد_مصوفة: true }),
        ادنى: منشئ_عام_للاقواس(مستوى, عداد, "Math.min", { عداد_مصوفة: true }),
        اشعار: (عقدة) => {
            const عنوان = عقدة.قيم.find((e) => e["المفتاح"] === "العنوان")?.[
                "القيمة"
            ].قيمة;
            const محتوى = عقدة.قيم.find((e) => e["المفتاح"] === "المحتوى")?.[
                "القيمة"
            ].قيمة;
            const شعار = عقدة.قيم.find((e) => e["المفتاح"] === "الشعار")?.[
                "القيمة"
            ].قيمة;
            const أمر_عند_الضغط = عقدة.قيم.find(
                (e) => e["المفتاح"] === "عند_الضغط"
            )?.["القيمة"].قيمة;
            return `
            if ("Notification" in window) {
              Notification.requestPermission().then(function (permission) {
                if (permission === "granted") {
                  const notification = new Notification(
                    ${عنوان}, {
                    body: ${محتوى},
                    icon: ${شعار}
                  });
                  notification.onclick = function () {
                    // هنا تحط الأمر اللي عايز تنفذه
                    ${أمر_عند_الضغط.replaceAll('"', "")}
                  };
                } else {
                  console.error("المستخدم رفض الإشعارات");
                }
              });
            } else {
              console.error("المتصفح لا يدعم الإشعارات");
            }
            `;
        },
        صحيح: منشئ_عام_للاقواس(مستوى, عداد, "parseInt"),
        عشري: (عقدة) => {
            const vals = عقدة.قيم.map((v) => إنشاء_الشفرة(v, مستوى, عداد));
            let القيمة;
            if (vals[0] == '"لانهائي"') {
                القيمة = "Infinity";
            } else if (vals[0] == '"-لانهائي"') {
                القيمة = "-Infinity";
            } else {
                القيمة = vals.join(", ");
            }
            return `parseFloat(${القيمة})`;
        },
        مصفوفة: منشئ_عام_للاقواس(مستوى, عداد, "JSON.parse", {
            هل_مصفوفة: true,
        }),

        // جلب: (عقدة) => {
        //     const القيم = عقدة.قيم.map((v) => إنشاء_الشفرة(v, مستوى, عداد));
        //     if (القيم[0] == "\"جسون\"") {
        //         return `getData();
        //         async function getData() {
        //             try {
        //                 const response = await fetch(القيم[1]);  // استدعاء الـ API
        //                 const data = await response.json(); // تحويل الاستجابة إلى JSON
        //                 return data; // إرجاع البيانات
        //             } catch (error) {
        //                 console.error(error);
        //             }
        //         }`;
        //     } else {
        //         return `fetch(${القيم[1]})`;
        //     }
        // },

        اضف: (عقدة) => {
            const قيم = عقدة.قيم
                .map((القيمة) => `${إنشاء_الشفرة(القيمة, 0, عداد)}`)
                .join(", ");
            return `${عقدة.المتغير}.push(${قيم});`;
        },
        امسح: (عقدة) => {
            const قيم = عقدة.قيم
                .map((القيمة) => `${إنشاء_الشفرة(القيمة, 0, عداد)}`)
                .join(", ");
            return `const index = ${عقدة.المتغير}.indexOf(${قيم});if (index > -1) {${عقدة.المتغير}.splice(index, 1);}`;
        },
        ادرج: (عقدة) => {
            const قيم = عقدة.قيم.map((القيمة) => إنشاء_الشفرة(القيمة, 0, عداد));
            return `${عقدة.المتغير}.splice(${قيم[0]}, 0, ${قيم[1]});`;
        },
        مفاتيح: (عقدة) => {
            return `Object.keys(${عقدة.المتغير})`;
        },

        ارجع: (عقدة) => `return ${إنشاء_الشفرة(عقدة.قيمة, مستوى, عداد)};`,
        استورد: (عقدة) => {
            if (عقدة.قيمة == null) return "";
            return `import "${عقدة.قيمة}";`;
        },
        احذف: (عقدة) => `${إنشاء_الشفرة(عقدة.قيمة, مستوى, عداد)} = undefined;`,
        عام: () => ``,
        استمر: () => `continue;`,
        توقف: () => `break;`,
        صح: () => `true`,
        خطأ: () => `false`,
        خطا: () => `false`,
        عدم: () => `null`,

        لاجل: (عقدة) => منشئ_لاجل(مستوى, عداد, عقدة, داخل_برنامج),
        بينما: (عقدة) => منشئ_بينما(مستوى, عداد, عقدة, داخل_برنامج),
        دالة: (عقدة) => منشئ_دالة(مستوى, عداد, عقدة, داخل_برنامج),
        استدعاء_دالة: (عقدة) => منشئ_استدعاء_دالة(عقدة),

        حاول: (عقدة) => منشئ_حاول(مستوى, عداد, عقدة, داخل_برنامج),
        خلل: (عقدة) => منشئ_حاول(مستوى, عداد, عقدة, داخل_برنامج),
        نهاية: (عقدة) => منشئ_حاول(مستوى, عداد, عقدة, داخل_برنامج),

        اذا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        إذا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        اوإذا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        اواذا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        والا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        وإلا: (عقدة) => منشئ_اذا(مستوى, عداد, عقدة, داخل_برنامج),
        تعبير_شرطي: (عقدة) => {
            return `(${إنشاء_الشفرة(عقدة.الشرط, مستوى, عداد)} ? ${إنشاء_الشفرة(
                عقدة.قيمة_اولى,
                مستوى,
                عداد
            )} : ${إنشاء_الشفرة(عقدة.قيمة_ثانية, مستوى, عداد)})`;
        },

        // المكتبات
        الوقت: (عقدة) => منشئ_الوقت(مستوى, عداد, عقدة),
        الرياضيات: (عقدة) => منشئ_الرياضيات(مستوى, عداد, عقدة),

        عملية: (عقدة) => منشئ_عمليات(عقدة, مستوى, عداد),
        قيمة: (عقدة) => {
            const v = عقدة.قيمة;
            if (typeof v === "boolean") return v ? "صح" : "خطا";
            if (v === null) return "عدم";
            if (!isNaN(v)) return v;
            return v;
        },
        معرف: (عقدة) => `${عقدة.اسم}`,
        تعابيرات: (عقدة) => {
            const list = عقدة.قيم
                .map((v) => إنشاء_الشفرة(v, 0, عداد))
                .join(", ");
            return `[${list}]`;
        },
        فهرس: (عقدة) => {
            const props = عقدة.خصائص
                .map(
                    ({ المفتاح, القيمة }) =>
                        `"${المفتاح}": ${إنشاء_الشفرة(القيمة, 0, عداد)}`
                )
                .join(", ");
            return `{${props}}`;
        },
        قائمة: (عقدة) => {
            const قيم = عقدة.قيم
                .map((القيمة) => `${إنشاء_الشفرة(القيمة, 0, عداد)}`)
                .join(", ");
            return `[${قيم}]`;
        },
        مترابطة: (عقدة) => {
            const قيم = عقدة.قيم
                .map((القيمة) => `${إنشاء_الشفرة(القيمة, 0, عداد)}`)
                .join(", ");
            return `(${قيم})`;
        },

        // دعم الفهرس المربع مثلا: مصفوفة[س]
        فهرس_عنصر: (عقدة) => {
            const list = إنشاء_الشفرة(عقدة.list, 0, عداد);
            const index = إنشاء_الشفرة(عقدة.index, 0, عداد);
            return `${list}[${index}]`;
        },

        // الواجهة
        صفحة: (عقدة) =>
            منشئ_عام_الواجهة(
                عقدة,
                عداد,
                "div",
                "height: 100vh; direction: rtl;"
            ),

        نص: (عقدة) => منشئ_عام_الواجهة(عقدة, عداد, "p"),
        رابط: (عقدة) => منشئ_عام_الواجهة(عقدة, عداد, "a"),

        عمودي: (عقدة) =>
            منشئ_عام_الواجهة(
                عقدة,
                عداد,
                "div",
                "display:flex; flex-direction:column;"
            ),
        رأسي: (عقدة) =>
            منشئ_عام_الواجهة(
                عقدة,
                عداد,
                "div",
                "display:flex; flex-direction:row;"
            ),
        توسيط: (عقدة) =>
            منشئ_عام_الواجهة(
                عقدة,
                عداد,
                "div",
                "display:flex; align-items: center; justify-content: center;"
            ),
        بطاقة: (عقدة) =>
            منشئ_عام_الواجهة(
                عقدة,
                عداد,
                "div",
                "margin: 10px; padding: 10px; border-radius: 10px; backdrop-filter: blur(6px); -webkit-backdrop-filter: blur(6px); background-color: #ffffff05;"
            ),
    };

    // التعامل مع المسافات و الاسطر الفارغة
    if (ast.نوع === "سطر_جديد") {
        return "\n";
    }
    if (ast.نوع === "مسافة") {
        return " ";
    }

    const مولد = مولدات[ast.نوع];
    if (!مولد) {
        const error = new Error(
            `المنشئ: "${ast.رمز?.القيمة || "فارغ"}" غير معروف`
        );
        error.line = `في السطر ` + (ast.رمز?.السطر || "غير معروف");
        throw error;
    }
    const خطوط = مولد(ast).split("\n");
    return خطوط.map((خط) => `${خط}`).join("\n");
}
