import { احصل, التالي, تحقق, المؤشر } from "./Core/TokenUtils.js";

import {
    محلل_عام_للاقواس_يسبقها_نقطة,
    محلل_عام_للاقواس,
    محلل_عام_للكلمات,
    محلل_عام_للكلمات_بقيمة,
} from "./Core/Statements/AlifGeneral.js";
import { محلل_متغير } from "./Core/Statements/AlifVariable.js";
import { محلل_لاجل } from "./Core/Statements/AlifFor.js";
import { محلل_بينما } from "./Core/Statements/AlifWhile.js";
import { محلل_دالة } from "./Core/Statements/AlifFunction.js";
import { محلل_اذا, محلل_اواذا, محلل_والا } from "./Core/Statements/AlifIF.js";
import { محلل_الواجهة } from "./Core/Statements/AlifUI.js";
import { محلل_العمليات } from "./Core/Statements/AlifOperations.js";
import { محلل_الوقت } from "./Core/Libraries/AlifTime.js";
import { محلل_استورد } from "./Core/Statements/AlifImport.js";
import { محلل_الرياضيات } from "./Core/Libraries/AlifMath.js";
import { محلل_حاول, محلل_خلل, محلل_نهاية } from "./Core/Statements/AlifTry.js";
import { محلل_صنف } from "./Core/Statements/AlifClass.js";
import { رمي_خطأ } from "./Core/AlifErrors.js";

export const محللات = {
    اطبع: محلل_عام_للاقواس,
    ادخل: محلل_عام_للاقواس,
    طول: محلل_عام_للاقواس,
    اقصى: محلل_عام_للاقواس,
    ادنى: محلل_عام_للاقواس,
    اصل: محلل_عام_للاقواس,
    اشعار: محلل_الواجهة,
    صحيح: محلل_عام_للاقواس,
    عشري: محلل_عام_للاقواس,
    مصفوفة: محلل_عام_للاقواس,
    // جلب: محلل_عام_للاقواس,
    اضف: محلل_عام_للاقواس_يسبقها_نقطة,
    ادرج: محلل_عام_للاقواس_يسبقها_نقطة,
    امسح: محلل_عام_للاقواس_يسبقها_نقطة,
    مفاتيح: محلل_عام_للاقواس_يسبقها_نقطة,
    استمر: محلل_عام_للكلمات,
    توقف: محلل_عام_للكلمات,
    عام: محلل_عام_للكلمات_بقيمة,
    استورد: محلل_استورد,
    ارجع: محلل_عام_للكلمات_بقيمة,
    احذف: محلل_عام_للكلمات_بقيمة,
    صح: محلل_عام_للكلمات,
    خطا: محلل_عام_للكلمات,
    خطأ: محلل_عام_للكلمات,
    عدم: محلل_عام_للكلمات,
    لاجل: محلل_لاجل,
    لأجل: محلل_لاجل,
    بينما: محلل_بينما,
    متغير: محلل_متغير,
    دالة: محلل_دالة,
    اذا: محلل_اذا,
    إذا: محلل_اذا,
    اوإذا: محلل_اواذا,
    اواذا: محلل_اواذا,
    والا: محلل_والا,
    وإلا: محلل_والا,
    عملية: محلل_العمليات,
    حاول: محلل_حاول,
    خلل: محلل_خلل,
    نهاية: محلل_نهاية,
    صنف: محلل_صنف,

    // ===== المكتبات =====
    الوقت: محلل_الوقت,
    الرياضيات: محلل_الرياضيات,

    // ===== الواجهة =====
    نص: محلل_الواجهة,
    رابط: محلل_الواجهة,
    عمودي: محلل_الواجهة,
    رأسي: محلل_الواجهة,
    توسيط: محلل_الواجهة,
    بطاقة: محلل_الواجهة,
    صفحة: محلل_الواجهة,
};

export function محلل_الجملة(الرموز, الدالة_الام) {
    const الامر = احصل(الرموز)?.القيمة;
    if (الامر && محللات[الامر])
        return محللات[الامر](الرموز, الدالة_الام, الامر);

    const متغير = محلل_متغير(الرموز, الدالة_الام || "غير معروف");
    if (متغير) return متغير;

    const رمز = احصل(الرموز);
    التالي(الرموز);
    if (رمز.النوع == "مسافة") {
        if (!تحقق(الرموز, "سطر_جديد"))
            رمي_خطأ("مسافة غير معروفة", الرموز, الدالة_الام);
    }
    return { نوع: "غير_معروف", رمز };
}

export function محلل_الرموز(الرموز) {
    if (!الرموز || !Array.isArray(الرموز)) {
        throw new Error(
            "الرموز غير معرفة أو غير صحيحة 'محلل_الرموز' " + الرموز
        );
    }

    function ابدأ() {
        const جمل = [];
        while (المؤشر < الرموز.length) {
            if (تحقق(الرموز, "سطر_جديد")) {
                التالي(الرموز);
                continue;
            }
            جمل.push(محلل_الجملة(الرموز, "برنامج"));
        }
        return { نوع: "برنامج", جمل };
    }
    return ابدأ();
}
